Ran Plan for 14 projects:

1. dir: `live/gcp/sandbox/dev.sandbox/vpc` workspace: `default`
1. dir: `live/gcp/andromeda/prod/vpc` workspace: `default`
1. dir: `live/gcp/andromeda/staging/vpc` workspace: `default`
1. dir: `live/gcp/sandbox/staging.sandbox/vpc` workspace: `default`
1. dir: `live/gcp/andromeda/dev/vpc` workspace: `default`
1. dir: `live/gcp/sandbox/prod.sandbox/vpc` workspace: `default`
1. dir: `live/gcp/andromeda/qa/vpc` workspace: `default`
1. dir: `live/gcp/andromeda/qa/compute-instance` workspace: `default`
1. dir: `live/gcp/andromeda/prod/compute-instance` workspace: `default`
1. dir: `live/gcp/sandbox/staging.sandbox/compute-instance` workspace: `default`
1. dir: `live/gcp/sandbox/dev.sandbox/compute-instance` workspace: `default`
1. dir: `live/gcp/andromeda/staging/compute-instance` workspace: `default`
1. dir: `live/gcp/sandbox/prod.sandbox/compute-instance` workspace: `default`
1. dir: `live/gcp/andromeda/dev/compute-instance` workspace: `default`

### 1. dir: `live/gcp/sandbox/dev.sandbox/vpc` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-02-21T03:07:12Z level=info msg=The stack at /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/dev.sandbox/vpc will be processed in the following order for command plan:
Group 1
- Module /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/dev.sandbox/vpc


google_compute_network.vpc: Refreshing state... [id=projects/sandbox-376723/global/networks/dev-sandbox-vpc]
google_compute_subnetwork.private_subnet: Refreshing state... [id=projects/sandbox-376723/regions/asia-southeast2/subnetworks/subnet-dev-sandbox-vpc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.fw_rules will be created
  + resource "google_compute_firewall" "fw_rules" {
      + creation_timestamp = (known after apply)
      + description        = "Creates default firewall rule to allow HTTP and SSH"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "firewall-dev-sandbox-vpc"
      + network            = "projects/sandbox-376723/global/networks/dev-sandbox-vpc"
      + priority           = 1000
      + project            = "sandbox-376723"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "webserver",
        ]

      + allow {
          + ports    = [
              + "22",
              + "80",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.fw_rules_https will be created
  + resource "google_compute_firewall" "fw_rules_https" {
      + creation_timestamp = (known after apply)
      + description        = "Creates default firewall rule to allow HTTPS"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "firewall-dev-sandbox-vpc-allow-https"
      + network            = "projects/sandbox-376723/global/networks/dev-sandbox-vpc"
      + priority           = 1000
      + project            = "sandbox-376723"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "allow-https",
        ]

      + allow {
          + ports    = [
              + "443",
            ]
          + protocol = "tcp"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + subnet_id = "projects/sandbox-376723/regions/asia-southeast2/subnetworks/subnet-dev-sandbox-vpc"
  + vpc_id    = "projects/sandbox-376723/global/networks/dev-sandbox-vpc"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/dev.sandbox/vpc/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/dev.sandbox/vpc/default.tfplan"
time=2023-02-21T03:07:32Z level=info msg=
Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "4.53.1"...
- Installing hashicorp/google v4.53.1...
- Installed hashicorp/google v4.53.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/gcp/sandbox/dev.sandbox/vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](http://35.219.21.124/lock?id=rdnuansa%252Fterraform-studidevops-5%252Flive%252Fgcp%252Fsandbox%252Fdev.sandbox%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/gcp/sandbox/dev.sandbox/vpc`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 2. dir: `live/gcp/andromeda/prod/vpc` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-02-21T03:07:13Z level=info msg=The stack at /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/prod/vpc will be processed in the following order for command plan:
Group 1
- Module /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/prod/vpc


google_compute_network.vpc: Refreshing state... [id=projects/andromeda-378216/global/networks/prod-andromeda-vpc]
google_compute_subnetwork.private_subnet: Refreshing state... [id=projects/andromeda-378216/regions/asia-southeast1/subnetworks/subnet-prod-andromeda-vpc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.fw_rules will be created
  + resource "google_compute_firewall" "fw_rules" {
      + creation_timestamp = (known after apply)
      + description        = "Creates default firewall rule to allow HTTP and SSH"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "firewall-prod-andromeda-vpc"
      + network            = "projects/andromeda-378216/global/networks/prod-andromeda-vpc"
      + priority           = 1000
      + project            = "andromeda-378216"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "webserver",
        ]

      + allow {
          + ports    = [
              + "22",
              + "80",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.fw_rules_https will be created
  + resource "google_compute_firewall" "fw_rules_https" {
      + creation_timestamp = (known after apply)
      + description        = "Creates default firewall rule to allow HTTPS"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "firewall-prod-andromeda-vpc-allow-https"
      + network            = "projects/andromeda-378216/global/networks/prod-andromeda-vpc"
      + priority           = 1000
      + project            = "andromeda-378216"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "allow-https",
        ]

      + allow {
          + ports    = [
              + "443",
            ]
          + protocol = "tcp"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + subnet_id = "projects/andromeda-378216/regions/asia-southeast1/subnetworks/subnet-prod-andromeda-vpc"
  + vpc_id    = "projects/andromeda-378216/global/networks/prod-andromeda-vpc"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/prod/vpc/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/prod/vpc/default.tfplan"
time=2023-02-21T03:07:33Z level=info msg=
Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "4.53.1"...
- Installing hashicorp/google v4.53.1...
- Installed hashicorp/google v4.53.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/gcp/andromeda/prod/vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](http://35.219.21.124/lock?id=rdnuansa%252Fterraform-studidevops-5%252Flive%252Fgcp%252Fandromeda%252Fprod%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/gcp/andromeda/prod/vpc`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 3. dir: `live/gcp/andromeda/staging/vpc` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-02-21T03:07:12Z level=info msg=The stack at /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/staging/vpc will be processed in the following order for command plan:
Group 1
- Module /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/staging/vpc


google_compute_network.vpc: Refreshing state... [id=projects/andromeda-378216/global/networks/staging-andromeda-vpc]
google_compute_subnetwork.private_subnet: Refreshing state... [id=projects/andromeda-378216/regions/asia-southeast1/subnetworks/subnet-staging-andromeda-vpc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.fw_rules will be created
  + resource "google_compute_firewall" "fw_rules" {
      + creation_timestamp = (known after apply)
      + description        = "Creates default firewall rule to allow HTTP and SSH"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "firewall-staging-andromeda-vpc"
      + network            = "projects/andromeda-378216/global/networks/staging-andromeda-vpc"
      + priority           = 1000
      + project            = "andromeda-378216"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "webserver",
        ]

      + allow {
          + ports    = [
              + "22",
              + "80",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.fw_rules_https will be created
  + resource "google_compute_firewall" "fw_rules_https" {
      + creation_timestamp = (known after apply)
      + description        = "Creates default firewall rule to allow HTTPS"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "firewall-staging-andromeda-vpc-allow-https"
      + network            = "projects/andromeda-378216/global/networks/staging-andromeda-vpc"
      + priority           = 1000
      + project            = "andromeda-378216"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "allow-https",
        ]

      + allow {
          + ports    = [
              + "443",
            ]
          + protocol = "tcp"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + subnet_id = "projects/andromeda-378216/regions/asia-southeast1/subnetworks/subnet-staging-andromeda-vpc"
  + vpc_id    = "projects/andromeda-378216/global/networks/staging-andromeda-vpc"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/staging/vpc/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/staging/vpc/default.tfplan"
time=2023-02-21T03:07:34Z level=info msg=
Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "4.53.1"...
- Installing hashicorp/google v4.53.1...
- Installed hashicorp/google v4.53.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/gcp/andromeda/staging/vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](http://35.219.21.124/lock?id=rdnuansa%252Fterraform-studidevops-5%252Flive%252Fgcp%252Fandromeda%252Fstaging%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/gcp/andromeda/staging/vpc`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 4. dir: `live/gcp/sandbox/staging.sandbox/vpc` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-02-21T03:07:12Z level=info msg=The stack at /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/staging.sandbox/vpc will be processed in the following order for command plan:
Group 1
- Module /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/staging.sandbox/vpc


google_compute_network.vpc: Refreshing state... [id=projects/sandbox-376723/global/networks/stg-sandbox-vpc]
google_compute_subnetwork.private_subnet: Refreshing state... [id=projects/sandbox-376723/regions/asia-southeast2/subnetworks/subnet-stg-sandbox-vpc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.fw_rules will be created
  + resource "google_compute_firewall" "fw_rules" {
      + creation_timestamp = (known after apply)
      + description        = "Creates default firewall rule to allow HTTP and SSH"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "firewall-stg-sandbox-vpc"
      + network            = "projects/sandbox-376723/global/networks/stg-sandbox-vpc"
      + priority           = 1000
      + project            = "sandbox-376723"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "webserver",
        ]

      + allow {
          + ports    = [
              + "22",
              + "80",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.fw_rules_https will be created
  + resource "google_compute_firewall" "fw_rules_https" {
      + creation_timestamp = (known after apply)
      + description        = "Creates default firewall rule to allow HTTPS"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "firewall-stg-sandbox-vpc-allow-https"
      + network            = "projects/sandbox-376723/global/networks/stg-sandbox-vpc"
      + priority           = 1000
      + project            = "sandbox-376723"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "allow-https",
        ]

      + allow {
          + ports    = [
              + "443",
            ]
          + protocol = "tcp"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + subnet_id = "projects/sandbox-376723/regions/asia-southeast2/subnetworks/subnet-stg-sandbox-vpc"
  + vpc_id    = "projects/sandbox-376723/global/networks/stg-sandbox-vpc"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/staging.sandbox/vpc/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/staging.sandbox/vpc/default.tfplan"
time=2023-02-21T03:07:34Z level=info msg=
Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "4.53.1"...
- Installing hashicorp/google v4.53.1...
- Installed hashicorp/google v4.53.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/gcp/sandbox/staging.sandbox/vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](http://35.219.21.124/lock?id=rdnuansa%252Fterraform-studidevops-5%252Flive%252Fgcp%252Fsandbox%252Fstaging.sandbox%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/gcp/sandbox/staging.sandbox/vpc`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 5. dir: `live/gcp/andromeda/dev/vpc` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-02-21T03:07:12Z level=info msg=The stack at /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/dev/vpc will be processed in the following order for command plan:
Group 1
- Module /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/dev/vpc


google_compute_network.vpc: Refreshing state... [id=projects/andromeda-378216/global/networks/dev-andromeda-vpc]
google_compute_subnetwork.private_subnet: Refreshing state... [id=projects/andromeda-378216/regions/asia-southeast1/subnetworks/subnet-dev-andromeda-vpc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.fw_rules will be created
  + resource "google_compute_firewall" "fw_rules" {
      + creation_timestamp = (known after apply)
      + description        = "Creates default firewall rule to allow HTTP and SSH"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "firewall-dev-andromeda-vpc"
      + network            = "projects/andromeda-378216/global/networks/dev-andromeda-vpc"
      + priority           = 1000
      + project            = "andromeda-378216"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "webserver",
        ]

      + allow {
          + ports    = [
              + "22",
              + "80",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.fw_rules_https will be created
  + resource "google_compute_firewall" "fw_rules_https" {
      + creation_timestamp = (known after apply)
      + description        = "Creates default firewall rule to allow HTTPS"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "firewall-dev-andromeda-vpc-allow-https"
      + network            = "projects/andromeda-378216/global/networks/dev-andromeda-vpc"
      + priority           = 1000
      + project            = "andromeda-378216"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "allow-https",
        ]

      + allow {
          + ports    = [
              + "443",
            ]
          + protocol = "tcp"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + subnet_id = "projects/andromeda-378216/regions/asia-southeast1/subnetworks/subnet-dev-andromeda-vpc"
  + vpc_id    = "projects/andromeda-378216/global/networks/dev-andromeda-vpc"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/dev/vpc/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/dev/vpc/default.tfplan"
time=2023-02-21T03:07:34Z level=info msg=
Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "4.53.1"...
- Installing hashicorp/google v4.53.1...
- Installed hashicorp/google v4.53.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/gcp/andromeda/dev/vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](http://35.219.21.124/lock?id=rdnuansa%252Fterraform-studidevops-5%252Flive%252Fgcp%252Fandromeda%252Fdev%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/gcp/andromeda/dev/vpc`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 6. dir: `live/gcp/sandbox/prod.sandbox/vpc` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-02-21T03:07:12Z level=info msg=The stack at /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/prod.sandbox/vpc will be processed in the following order for command plan:
Group 1
- Module /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/prod.sandbox/vpc


google_compute_network.vpc: Refreshing state... [id=projects/sandbox-376723/global/networks/prod-sandbox-vpc]
google_compute_subnetwork.private_subnet: Refreshing state... [id=projects/sandbox-376723/regions/asia-southeast2/subnetworks/subnet-prod-sandbox-vpc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.fw_rules will be created
  + resource "google_compute_firewall" "fw_rules" {
      + creation_timestamp = (known after apply)
      + description        = "Creates default firewall rule to allow HTTP and SSH"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "firewall-prod-sandbox-vpc"
      + network            = "projects/sandbox-376723/global/networks/prod-sandbox-vpc"
      + priority           = 1000
      + project            = "sandbox-376723"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "webserver",
        ]

      + allow {
          + ports    = [
              + "22",
              + "80",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.fw_rules_https will be created
  + resource "google_compute_firewall" "fw_rules_https" {
      + creation_timestamp = (known after apply)
      + description        = "Creates default firewall rule to allow HTTPS"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "firewall-prod-sandbox-vpc-allow-https"
      + network            = "projects/sandbox-376723/global/networks/prod-sandbox-vpc"
      + priority           = 1000
      + project            = "sandbox-376723"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "allow-https",
        ]

      + allow {
          + ports    = [
              + "443",
            ]
          + protocol = "tcp"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + subnet_id = "projects/sandbox-376723/regions/asia-southeast2/subnetworks/subnet-prod-sandbox-vpc"
  + vpc_id    = "projects/sandbox-376723/global/networks/prod-sandbox-vpc"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/prod.sandbox/vpc/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/prod.sandbox/vpc/default.tfplan"
time=2023-02-21T03:07:34Z level=info msg=
Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "4.53.1"...
- Installing hashicorp/google v4.53.1...
- Installed hashicorp/google v4.53.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/gcp/sandbox/prod.sandbox/vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](http://35.219.21.124/lock?id=rdnuansa%252Fterraform-studidevops-5%252Flive%252Fgcp%252Fsandbox%252Fprod.sandbox%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/gcp/sandbox/prod.sandbox/vpc`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 7. dir: `live/gcp/andromeda/qa/vpc` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-02-21T03:07:12Z level=info msg=The stack at /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/qa/vpc will be processed in the following order for command plan:
Group 1
- Module /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/qa/vpc


google_compute_network.vpc: Refreshing state... [id=projects/andromeda-378216/global/networks/qa-andromeda-vpc]
google_compute_subnetwork.private_subnet: Refreshing state... [id=projects/andromeda-378216/regions/asia-southeast1/subnetworks/subnet-qa-andromeda-vpc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.fw_rules will be created
  + resource "google_compute_firewall" "fw_rules" {
      + creation_timestamp = (known after apply)
      + description        = "Creates default firewall rule to allow HTTP and SSH"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "firewall-qa-andromeda-vpc"
      + network            = "projects/andromeda-378216/global/networks/qa-andromeda-vpc"
      + priority           = 1000
      + project            = "andromeda-378216"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "webserver",
        ]

      + allow {
          + ports    = [
              + "22",
              + "80",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.fw_rules_https will be created
  + resource "google_compute_firewall" "fw_rules_https" {
      + creation_timestamp = (known after apply)
      + description        = "Creates default firewall rule to allow HTTPS"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "firewall-qa-andromeda-vpc-allow-https"
      + network            = "projects/andromeda-378216/global/networks/qa-andromeda-vpc"
      + priority           = 1000
      + project            = "andromeda-378216"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "allow-https",
        ]

      + allow {
          + ports    = [
              + "443",
            ]
          + protocol = "tcp"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + subnet_id = "projects/andromeda-378216/regions/asia-southeast1/subnetworks/subnet-qa-andromeda-vpc"
  + vpc_id    = "projects/andromeda-378216/global/networks/qa-andromeda-vpc"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/qa/vpc/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/qa/vpc/default.tfplan"
time=2023-02-21T03:07:34Z level=info msg=
Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "4.53.1"...
- Installing hashicorp/google v4.53.1...
- Installed hashicorp/google v4.53.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/gcp/andromeda/qa/vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](http://35.219.21.124/lock?id=rdnuansa%252Fterraform-studidevops-5%252Flive%252Fgcp%252Fandromeda%252Fqa%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/gcp/andromeda/qa/vpc`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 8. dir: `live/gcp/andromeda/qa/compute-instance` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-02-21T03:07:36Z level=info msg=The stack at /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/qa/compute-instance will be processed in the following order for command plan:
Group 1
- Module /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/qa/compute-instance


google_compute_instance.vm_instance[0]: Refreshing state... [id=projects/andromeda-378216/zones/asia-southeast1-b/instances/qa-app]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # google_compute_instance.vm_instance[0] will be updated in-place
  ~ resource "google_compute_instance" "vm_instance" {
        id                        = "projects/andromeda-378216/zones/asia-southeast1-b/instances/qa-app"
        name                      = "qa-app"
        tags                      = [
            "webserver",
        ]
        # (18 unchanged attributes hidden)

      ~ network_interface {
            name               = "nic0"
          ~ network            = "https://www.googleapis.com/compute/v1/projects/andromeda-378216/global/networks/qa-andromeda-vpc" -> "DUMMY_VPC_ID"
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/andromeda-378216/regions/asia-southeast1/subnetworks/subnet-qa-andromeda-vpc" -> "DUMMY_SUBNET_ID"
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/qa/compute-instance/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/qa/compute-instance/default.tfplan"
time=2023-02-21T03:07:45Z level=info msg=
Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "4.53.1"...
- Installing hashicorp/google v4.53.1...
- Installed hashicorp/google v4.53.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/gcp/andromeda/qa/compute-instance`
* :put_litter_in_its_place: To **delete** this plan click [here](http://35.219.21.124/lock?id=rdnuansa%252Fterraform-studidevops-5%252Flive%252Fgcp%252Fandromeda%252Fqa%252Fcompute-instance%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/gcp/andromeda/qa/compute-instance`
</details>
Plan: 0 to add, 1 to change, 0 to destroy.

---
### 9. dir: `live/gcp/andromeda/prod/compute-instance` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-02-21T03:07:36Z level=info msg=The stack at /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/prod/compute-instance will be processed in the following order for command plan:
Group 1
- Module /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/prod/compute-instance


google_compute_instance.vm_instance[1]: Refreshing state... [id=projects/andromeda-378216/zones/asia-southeast1-c/instances/prod-app2]
google_compute_instance.vm_instance[0]: Refreshing state... [id=projects/andromeda-378216/zones/asia-southeast1-c/instances/prod-app1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # google_compute_instance.vm_instance[0] will be updated in-place
  ~ resource "google_compute_instance" "vm_instance" {
        id                        = "projects/andromeda-378216/zones/asia-southeast1-c/instances/prod-app1"
        name                      = "prod-app1"
        tags                      = [
            "webserver",
        ]
        # (18 unchanged attributes hidden)

      ~ network_interface {
            name               = "nic0"
          ~ network            = "https://www.googleapis.com/compute/v1/projects/andromeda-378216/global/networks/prod-andromeda-vpc" -> "DUMMY_VPC_ID"
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/andromeda-378216/regions/asia-southeast1/subnetworks/subnet-prod-andromeda-vpc" -> "DUMMY_SUBNET_ID"
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # google_compute_instance.vm_instance[1] will be updated in-place
  ~ resource "google_compute_instance" "vm_instance" {
        id                        = "projects/andromeda-378216/zones/asia-southeast1-c/instances/prod-app2"
        name                      = "prod-app2"
        tags                      = [
            "webserver",
        ]
        # (18 unchanged attributes hidden)

      ~ network_interface {
            name               = "nic0"
          ~ network            = "https://www.googleapis.com/compute/v1/projects/andromeda-378216/global/networks/prod-andromeda-vpc" -> "DUMMY_VPC_ID"
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/andromeda-378216/regions/asia-southeast1/subnetworks/subnet-prod-andromeda-vpc" -> "DUMMY_SUBNET_ID"
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/prod/compute-instance/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/prod/compute-instance/default.tfplan"
time=2023-02-21T03:07:49Z level=info msg=
Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "4.53.1"...
- Installing hashicorp/google v4.53.1...
- Installed hashicorp/google v4.53.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/gcp/andromeda/prod/compute-instance`
* :put_litter_in_its_place: To **delete** this plan click [here](http://35.219.21.124/lock?id=rdnuansa%252Fterraform-studidevops-5%252Flive%252Fgcp%252Fandromeda%252Fprod%252Fcompute-instance%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/gcp/andromeda/prod/compute-instance`
</details>
Plan: 0 to add, 2 to change, 0 to destroy.

---
### 10. dir: `live/gcp/sandbox/staging.sandbox/compute-instance` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-02-21T03:07:37Z level=info msg=The stack at /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/staging.sandbox/compute-instance will be processed in the following order for command plan:
Group 1
- Module /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/staging.sandbox/compute-instance


google_compute_instance.vm_instance[0]: Refreshing state... [id=projects/sandbox-376723/zones/asia-southeast2-b/instances/stg-app]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # google_compute_instance.vm_instance[0] will be updated in-place
  ~ resource "google_compute_instance" "vm_instance" {
        id                        = "projects/sandbox-376723/zones/asia-southeast2-b/instances/stg-app"
        name                      = "stg-app"
        tags                      = [
            "webserver",
        ]
        # (18 unchanged attributes hidden)

      ~ network_interface {
            name               = "nic0"
          ~ network            = "https://www.googleapis.com/compute/v1/projects/sandbox-376723/global/networks/stg-sandbox-vpc" -> "DUMMY_VPC_ID"
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/sandbox-376723/regions/asia-southeast2/subnetworks/subnet-stg-sandbox-vpc" -> "DUMMY_SUBNET_ID"
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/staging.sandbox/compute-instance/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/staging.sandbox/compute-instance/default.tfplan"
time=2023-02-21T03:07:55Z level=info msg=
Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "4.53.1"...
- Installing hashicorp/google v4.53.1...
- Installed hashicorp/google v4.53.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/gcp/sandbox/staging.sandbox/compute-instance`
* :put_litter_in_its_place: To **delete** this plan click [here](http://35.219.21.124/lock?id=rdnuansa%252Fterraform-studidevops-5%252Flive%252Fgcp%252Fsandbox%252Fstaging.sandbox%252Fcompute-instance%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/gcp/sandbox/staging.sandbox/compute-instance`
</details>
Plan: 0 to add, 1 to change, 0 to destroy.

---
### 11. dir: `live/gcp/sandbox/dev.sandbox/compute-instance` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-02-21T03:07:37Z level=info msg=The stack at /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/dev.sandbox/compute-instance will be processed in the following order for command plan:
Group 1
- Module /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/dev.sandbox/compute-instance


google_compute_instance.vm_instance[0]: Refreshing state... [id=projects/sandbox-376723/zones/asia-southeast2-a/instances/dev-app]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # google_compute_instance.vm_instance[0] will be updated in-place
  ~ resource "google_compute_instance" "vm_instance" {
        id                        = "projects/sandbox-376723/zones/asia-southeast2-a/instances/dev-app"
        name                      = "dev-app"
        tags                      = [
            "webserver",
        ]
        # (18 unchanged attributes hidden)

      ~ network_interface {
            name               = "nic0"
          ~ network            = "https://www.googleapis.com/compute/v1/projects/sandbox-376723/global/networks/dev-sandbox-vpc" -> "DUMMY_VPC_ID"
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/sandbox-376723/regions/asia-southeast2/subnetworks/subnet-dev-sandbox-vpc" -> "DUMMY_SUBNET_ID"
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/dev.sandbox/compute-instance/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/dev.sandbox/compute-instance/default.tfplan"
time=2023-02-21T03:07:57Z level=info msg=
Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "4.53.1"...
- Installing hashicorp/google v4.53.1...
- Installed hashicorp/google v4.53.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/gcp/sandbox/dev.sandbox/compute-instance`
* :put_litter_in_its_place: To **delete** this plan click [here](http://35.219.21.124/lock?id=rdnuansa%252Fterraform-studidevops-5%252Flive%252Fgcp%252Fsandbox%252Fdev.sandbox%252Fcompute-instance%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/gcp/sandbox/dev.sandbox/compute-instance`
</details>
Plan: 0 to add, 1 to change, 0 to destroy.

---
### 12. dir: `live/gcp/andromeda/staging/compute-instance` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-02-21T03:07:37Z level=info msg=The stack at /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/staging/compute-instance will be processed in the following order for command plan:
Group 1
- Module /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/staging/compute-instance


google_compute_instance.vm_instance[0]: Refreshing state... [id=projects/andromeda-378216/zones/asia-southeast1-b/instances/staging-app]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # google_compute_instance.vm_instance[0] will be updated in-place
  ~ resource "google_compute_instance" "vm_instance" {
        id                        = "projects/andromeda-378216/zones/asia-southeast1-b/instances/staging-app"
        name                      = "staging-app"
        tags                      = [
            "webserver",
        ]
        # (18 unchanged attributes hidden)

      ~ network_interface {
            name               = "nic0"
          ~ network            = "https://www.googleapis.com/compute/v1/projects/andromeda-378216/global/networks/staging-andromeda-vpc" -> "DUMMY_VPC_ID"
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/andromeda-378216/regions/asia-southeast1/subnetworks/subnet-staging-andromeda-vpc" -> "DUMMY_SUBNET_ID"
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/staging/compute-instance/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/andromeda/staging/compute-instance/default.tfplan"
time=2023-02-21T03:07:57Z level=info msg=
Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "4.53.1"...
- Installing hashicorp/google v4.53.1...
- Installed hashicorp/google v4.53.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/gcp/andromeda/staging/compute-instance`
* :put_litter_in_its_place: To **delete** this plan click [here](http://35.219.21.124/lock?id=rdnuansa%252Fterraform-studidevops-5%252Flive%252Fgcp%252Fandromeda%252Fstaging%252Fcompute-instance%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/gcp/andromeda/staging/compute-instance`
</details>
Plan: 0 to add, 1 to change, 0 to destroy.

---
### 13. dir: `live/gcp/sandbox/prod.sandbox/compute-instance` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-02-21T03:07:37Z level=info msg=The stack at /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/prod.sandbox/compute-instance will be processed in the following order for command plan:
Group 1
- Module /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/prod.sandbox/compute-instance


google_compute_instance.vm_instance[0]: Refreshing state... [id=projects/sandbox-376723/zones/asia-southeast2-c/instances/prod-app1]
google_compute_instance.vm_instance[2]: Refreshing state... [id=projects/sandbox-376723/zones/asia-southeast2-c/instances/prod-app3]
google_compute_instance.vm_instance[1]: Refreshing state... [id=projects/sandbox-376723/zones/asia-southeast2-c/instances/prod-app2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # google_compute_instance.vm_instance[0] will be updated in-place
  ~ resource "google_compute_instance" "vm_instance" {
        id                        = "projects/sandbox-376723/zones/asia-southeast2-c/instances/prod-app1"
        name                      = "prod-app1"
        tags                      = [
            "webserver",
        ]
        # (18 unchanged attributes hidden)

      ~ network_interface {
            name               = "nic0"
          ~ network            = "https://www.googleapis.com/compute/v1/projects/sandbox-376723/global/networks/prod-sandbox-vpc" -> "DUMMY_VPC_ID"
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/sandbox-376723/regions/asia-southeast2/subnetworks/subnet-prod-sandbox-vpc" -> "DUMMY_SUBNET_ID"
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # google_compute_instance.vm_instance[1] will be updated in-place
  ~ resource "google_compute_instance" "vm_instance" {
        id                        = "projects/sandbox-376723/zones/asia-southeast2-c/instances/prod-app2"
        name                      = "prod-app2"
        tags                      = [
            "webserver",
        ]
        # (18 unchanged attributes hidden)

      ~ network_interface {
            name               = "nic0"
          ~ network            = "https://www.googleapis.com/compute/v1/projects/sandbox-376723/global/networks/prod-sandbox-vpc" -> "DUMMY_VPC_ID"
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/sandbox-376723/regions/asia-southeast2/subnetworks/subnet-prod-sandbox-vpc" -> "DUMMY_SUBNET_ID"
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # google_compute_instance.vm_instance[2] will be updated in-place
  ~ resource "google_compute_instance" "vm_instance" {
        id                        = "projects/sandbox-376723/zones/asia-southeast2-c/instances/prod-app3"
        name                      = "prod-app3"
        tags                      = [
            "webserver",
        ]
        # (18 unchanged attributes hidden)

      ~ network_interface {
            name               = "nic0"
          ~ network            = "https://www.googleapis.com/compute/v1/projects/sandbox-376723/global/networks/prod-sandbox-vpc" -> "DUMMY_VPC_ID"
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/sandbox-376723/regions/asia-southeast2/subnetworks/subnet-prod-sandbox-vpc" -> "DUMMY_SUBNET_ID"
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/prod.sandbox/compute-instance/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/rdnuansa/terraform-studidevops-5/2/default/live/gcp/sandbox/prod.sandbox/compute-instance/default.tfplan"
time=2023-02-21T03:07:57Z level=info msg=
Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "4.53.1"...
- Installing hashicorp/google v4.53.1...
- Installed hashicorp/google v4.53.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/gcp/sandbox/prod.sandbox/compute-instance`
* :put_litter_in_its_place: To **delete** this plan click [here](http://35.219.21.124/lock?id=rdnuansa%252Fterraform-studidevops-5%252Flive%252Fgcp%252Fsandbox%252Fprod.sandbox%252Fcompute-instance%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/gcp/sandbox/prod.sandbox/compute-instance`
</details>
Plan: 0 to add, 3 to change, 0 to destroy.

---
### 14. dir: `live/gcp/andromeda/dev/compute-instance` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2023-02-21T03:07:37Z level=info msg=The stack at /root/
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.